{
    "from": "now-70m",
    "to": "now-10m",
    "interval": "60m",
    "query": "FROM :index-name
| WHERE host=="us-host1"
",
    "actions": [
        {
            "group": "default",
            "id": "93ec3400-3485-11ef-a17f-47c5c7b19462",
            "params": {
                "documents": [
                    {
                        "rule.id": "{{rule.id}}",
                        "rule.rule_id": "{{rule.rule_id}}",
                        "rule.params.riskScore": "{{rule.params.riskScore}}",
                        "rule.params.severity": "{{rule.params.severity}}",
                        "rule.params.from": "{{rule.params.from}}",
                        "rule.params.to": "{{rule.params.to}}",
                        "rule.name": "{{rule.name}}",
                        "@timestamp": "{{date}}",
                        "context.results_link": "{{context.results_link}}",
                        "agg": "{{#ParseHjson}}[ {{#context.alerts}}{{ag}},{{/context.alerts}} ]{{/ParseHjson}}",
                        "uc_id": "UC_1001",
                        "uc_type": "siem",
                        "uc_status": "SOC_WARRANTY",
                        "uc_short_name": "LOGS_MISSING",
                        "uc_long_name": "Missing logs from Key Devices",
                        "uc_severity": "8",
                        "uc_tags": "ESQL|ABC|LOGS_MISSING",
                        "uc_tactic_id": "TA0040",
                        "uc_technique_ids": "T1489"
                    }
                ]
            },
            "action_type_id": ".index"
        }
    ],
    "rule_id": "UC_1001",
    "description": "Missing logs from Key Devices",
    "enabled": true,
    "false_positives": [],
    "language": "esql",
    "type": "esql",
    "max_signals": 100,
    "name": "UC_1001 - LOGS_MISSING",
    "references": ["https://wiki/soc_playbooks/UC_1001.playbook"],
    "risk_score": "{{context.risk_score}}",
    "risk_score_mapping": [
        {
            "field": "user.name",
            "operator": "equals",
            "value": "",
            "risk_score": "32"
        }
    ],
    "severity": "high",
    "tags": ["ESQL", "ABC", "LOGS_MISSING"],
    "threat": [
        {
            "framework": "MITRE ATT&CK",
            "tactic": {
                "id": "TA0040",
                "name": "TA0040",
                "reference": "https://attack.mitre.org/tactics/TA0040"
            },
            "technique": [
                                {
                    "id": "T1489",
                    "name": "T1489",
                    "reference": "https://attack.mitre.org/techniques/T1489"
                }                            ]
        }
    ]
}
