{
    "from": "now-70m",
    "to": "now-10m",
    "interval": "60m",
    "query": "FROM :index-name\n| WHERE host==\"us-host1\"\n",
    "actions": [
            {
            "group": "default",
            "id": "email-action-id-12345",
            "action_type_id": ".email",
            "params": {
                "to": ["soc@company.com", "security-team@company.com"],
                "subject": "SIEM Alert: UC_1001 - LOGS_MISSING",
                "message": "Alert: Missing logs from Key Devices\nSeverity: 8\nRule ID: UC_1001\nStatus: SOC_DEV"
            }
        }            ],
    "rule_id": "UC_1001",
    "description": "Missing logs from Key Devices",
    "enabled": true,
    "false_positives": [],
    "language": "esql",
    "type": "esql",
    "max_signals": 100,
    "name": "UC_1001 - LOGS_MISSING",
    "references": ["https://wiki/wikipage/UC_1001.playbook"],
    "risk_score": "{{context.risk_score}}",
    "risk_score_mapping": [
        {
            "field": "user.name",
            "operator": "equals",
            "value": "",
            "risk_score": "32"
        }
    ],
    "severity": "high",
    "tags": ["ESQL", "ABC", "LOGS_MISSING"],
    "threat": [
        {
            "framework": "MITRE ATT&CK",
            "tactic": {
                "id": "TA0040",
                "name": "TA0040",
                "reference": "https://attack.mitre.org/tactics/TA0040"
            },
            "technique": [
                {
                    "id": "T1489",
                    "name": "T1489",
                    "reference": "https://attack.mitre.org/techniques/T1489"
                }            ]
        }
    ]
}